[{"BRAND":"Nintendo", "PNAME":"64", "GNAME":"empty", "COST":"79.99", "MSRP":"199.99", "QTYONHAND":"6", "QTYBACK":"4", "DESC":"The Nintendo 64 (N64) is a home video game console developed by Nintendo. The successor to the Super Nintendo Entertainment System, it was released on June 23, 1996, in Japan, on September 29, 1996, in North America, and March 1, 1997, in Europe and Australia. It was the last major home console to use cartridges as its primary storage format until the Nintendo Switch in 2017. As a fifth-generation console, it competed primarily with the Sony PlayStation and the Sega Saturn." }, {"BRAND":"Nintendo", "PNAME":"Gamecube", "GNAME":"empty", "COST":"59.99", "MSRP":"199.99", "QTYONHAND":"9", "QTYBACK":"3", "DESC":"The GameCube is a home video game console developed and released by Nintendo in Japan on September 14, 2001, in North America on November 18, 2001, and in PAL territories in 2002. It is the successor to the Nintendo 64, which released in 1996, and predecessor of the Wii, which released in 2006. As Nintendo's entry in the sixth generation of video game consoles, the GameCube competed with Sony's PlayStation 2 and Microsoft's Xbox." },{"BRAND":"Nintendo", "PNAME":"Wii", "GNAME":"empty", "COST":"149.99", "MSRP":"249.99", "QTYONHAND":"21", "QTYBACK":"5", "DESC":"The Wii is a home video game console developed and marketed by Nintendo. It was released on November 19, 2006, in North America and in December 2006 for most other regions of the world. It is Nintendo's fifth major home game console, following the GameCube and is a seventh generation home console alongside Microsoft's Xbox 360 and Sony's PlayStation 3." },{"BRAND":"Nintendo", "PNAME":"Wii U", "GNAME":"empty", "COST":"79.99", "MSRP":"299.99", "QTYONHAND":"6", "QTYBACK":"1", "DESC":"The Wii U is a home video game console developed by Nintendo as the successor to the Wii. Released in late 2012, it is the first eighth-generation video game console and competed with Microsoft's Xbox One and Sony's PlayStation 4." },{"BRAND":"Nintendo", "PNAME":"Switch", "GNAME":"empty", "COST":"319.99", "MSRP":"399.99", "QTYONHAND":"2", "QTYBACK":"6", "DESC":"The Nintendo Switch is a video game console developed by Nintendo and released worldwide in most regions on March 3, 2017. The console itself is a tablet that can either be docked for use as a home console or used as a portable device, making it a hybrid console. Its wireless Joy-Con controllers, with standard buttons and directional analog sticks for user input, motion sensing, and tactile feedback, can attach to both sides of the console to support handheld-style play. They can also connect to a grip accessory to provide a traditional home console gamepad form, or be used individually in the hand like the Wii Remote and Nunchuk, supporting local multiplayer modes." },{"BRAND":"Sony", "PNAME":"Playstation", "GNAME":"empty", "COST":"59.99", "MSRP":"299.99", "QTYONHAND":"18", "QTYBACK":"4", "DESC":"The PlayStation (abbreviated as PS, commonly known as the PS1 or its codename PSX) is a home video game console developed and marketed by Sony Computer Entertainment. It was released on 3 December 1994 in Japan, 9 September 1995 in North America, 29 September 1995 in Europe, and 15 November 1995 in Australia. As a fifth-generation console, the PlayStation primarily contended with the Nintendo 64 and the Sega Saturn." },{"BRAND":"Sony", "PNAME":"Playstation 2", "GNAME":"empty", "COST":"69.99", "MSRP":"299.99", "QTYONHAND":"36", "QTYBACK":"5", "DESC":"The PlayStation 2 (PS2) is a home video game console developed and marketed by Sony Computer Entertainment. It was first released in Japan on March 4, 2000, in North America on October 26, 2000, in Europe on November 24, 2000, and in Australia on November 30, 2000. It is the successor to the original PlayStation, as well as the second installment in the PlayStation brand of consoles." },{"BRAND":"Sony", "PNAME":"Playstation 3", "GNAME":"empty", "COST":"119.99", "MSRP":"549.99", "QTYONHAND":"7", "QTYBACK":"8", "DESC":"The PlayStation 3 (PS3) is a home video game console developed by Sony Computer Entertainment. The successor to the PlayStation 2, it is part of the PlayStation brand of consoles. It was first released on November 11, 2006, in Japan, November 17, 2006, in North America, and March 23, 2007, in Europe and Australia. The PlayStation 3 competed primarily against Microsoft's Xbox 360 and Nintendo's Wii as part of the seventh generation of video game consoles." },{"BRAND":"Sony", "PNAME":"Playstation 4", "GNAME":"empty", "COST":"279.99", "MSRP":"399.99", "QTYONHAND":"12", "QTYBACK":"3", "DESC":"The PlayStation 4 (PS4) is a home video game console developed by Sony Computer Entertainment. Announced as the successor to the PlayStation 3 in February 2013, it was launched on November 15, 2013, in North America, November 29, 2013 in Europe, South America and Australia, and on February 22, 2014 in Japan. A console of the eighth generation, it competes with Microsoft's Xbox One and Nintendo's Wii U and Switch." },{"BRAND":"Sony", "PNAME":"Playstation 5", "GNAME":"empty", "COST":"629.99", "MSRP":"629.99", "QTYONHAND":"1", "QTYBACK":"15", "DESC":"The PlayStation 5 (PS5) is a home video game console developed by Sony Interactive Entertainment. Announced in 2019 as the successor to the PlayStation 4, the PS5 was released on November 12, 2020, in Australia, Japan, New Zealand, North America, and South Korea, with worldwide release following a week later. The PS5 is part of the ninth generation of video game consoles, along with Microsoft's Xbox Series X and Series S consoles, which were released in the same month." },{"BRAND":"Microsoft", "PNAME":"Xbox", "GNAME":"empty", "COST":"149.99", "MSRP":"299.99", "QTYONHAND":"3", "QTYBACK":"5", "DESC":"The Xbox is a home video game console and the first installment in the Xbox series of video game consoles manufactured by Microsoft. It was released as Microsoft's first foray into the gaming console market on November 15, 2001, in North America, followed by Australia, Europe and Japan in 2002. It is classified as a sixth-generation console, competing with Sony's PlayStation 2 and Nintendo's GameCube. It was also the first major console produced by an American company since the release of the Atari Jaguar in 1993." },{"BRAND":"Microsoft", "PNAME":"Xbox 360", "GNAME":"empty", "COST":"79.99", "MSRP":"399.99", "QTYONHAND":"13", "QTYBACK":"4", "DESC":"The Xbox 360 is a home video game console developed by Microsoft. As the successor to the original Xbox, it is the second console in the Xbox series. It competed with Sony's PlayStation 3 and Nintendo's Wii as part of the seventh generation of video game consoles. It was officially unveiled on MTV on May 12, 2005, with detailed launch and game information announced later that month at the 2005 Electronic Entertainment Expo." },{"BRAND":"Microsoft", "PNAME":"Xbox One", "GNAME":"empty", "COST":"179.99", "MSRP":"499.99", "QTYONHAND":"8", "QTYBACK":"2", "DESC":"The Xbox One is a home video game console developed by Microsoft. Announced in May 2013, it is the successor to Xbox 360 and the third base console in the Xbox series of video game consoles. It was first released in North America, parts of Europe, Australia, and South America in November 2013 and in Japan, China, and other European countries in September 2014. It is the first Xbox game console to be released in China, specifically in the Shanghai Free-Trade Zone." },{"BRAND":"Microsoft", "PNAME":"Xbox Series S", "GNAME":"empty", "COST":"379.99", "MSRP":"199.99", "QTYONHAND":"5", "QTYBACK":"7", "DESC":"The Xbox Series S is a home video game console developed by Microsoft. It was released on November 10, 2020, as the fourth generation of the Xbox console family, succeeding the Xbox One." },{"BRAND":"Microsoft", "PNAME":"Xbox Series X", "GNAME":"empty", "COST":"599.99", "MSRP":"199.99", "QTYONHAND":"1", "QTYBACK":"12", "DESC":"The Xbox Series X is a home video game console developed by Microsoft. It was released on November 10, 2020, as the fourth generation of the Xbox console family, succeeding the Xbox One. The Xbox Series X has higher-end hardware and supports higher display resolutions (up to 8K resolution), along with higher frame rates and real-time ray tracing; it also has a high-speed solid-state drive (SSD) to reduce loading times." }]
